badwords=[
    'sex', 'your mom', '늑음마', '느금', '느그마', '느금마', '시발', 'ㅈㄴ',
    '좆나', '존나', '좋나', '암컷타락', '딸친다', '딸치', '딸딸이', '노알라',
    '노짱', '그립습니다', '놎장', '노무현', 'mc무현', '이명박근혜', '이재명',
    'no무현', 'MC무현', 'MC발년', '박원순', '무현짱', '노무노무', '노무',
    '그립습니노', '보지', 'bozi', '개보지', '노애미', '헤응', '하앙', '뷰릇',
    '보추', '성기훈', '성기', '니앰창', '엠창', '니 amy', '니ami', '비응신',
    'be응신', '븅', '뷰웅신', '병신', '시봘', '감인', '개샊', '씹샊', '개색히', '십색히', '꼬추', '개보지',
    'ㅄ','ㅂㅅ', 'ㅂㅊ', '폰섹', '섹스', '정액', '섻', 'cex',  '아항', '헤으응', '가버렷', '가버렸', '박아줘',
    '앙', '흐응', '뷰르릇', '뷰룻', '부룻', '불알', '부랄', '히토미', '코알라무현','mc재명', '재명이', '재명',
    '재명이네마을', '민생지원금', '시진핑', '짱깨', '장깨', '짱개', '야스','곶', '6974', '69', '질싸', '쌌다',
    '콘돔', '형수보지', '형보수지', '봊이', '뷰지', '쥬지', '이승만', '윤석열', '박근혜', '박정희', 'suicide',
    '성남시장', '쎅스', '석스', '세엑스', '섹쓰', '야아스', '븆이', 'ㅅ달티다', '즌나', '종나', 'ㅅl발', 'ㅅ발',
    'ㅅㅔㄱ', '서ㅣㄱ', '세ㄳ', '색스', '사ㅣㄱ스', '샋으', '갮', 'sexual', 'sexer','병', '염병', '찢재명',
    '찟재명','찢찢', '드럼통',' 드럼통아저씨', '드럼통령','드럼통대통령', '빨간당','파란당','붉은당','푸른당','빨강파랑주황'
    ,'개혁신당','국힘','국민의힘','민주당','더불어민주당','죄명이','이죄명','윤건희','김건희','윤석열','석여리','석열이','서결이',
    '윤서결','김석열', '석열','kim건희','kimgunhee','건희김','킴건희','노무알라','찢칠라','잼칠라','찟칠라','탄핵','ㅗ','새끼','샛키',
    '새기','쌔끼','색히','새기','샊', '뻨','뻐커','퍼커','퍼ㅓ커','fucker','fuker','fucer','fuck','fuXX','시X', '니네엄마',
    '니네아빠','써겨리','니아빠','느그아빠','seex','섹슈얼','창년','상년','쌍년','썅년','박찬대','형수욕','김현지','현지누나'
]

whitelist=['보지마', '보지말아', '보지 마', '섹션', '시발자동차', '시발 자동차', '시발차', '어ㅄ', '익', '병따개', '병딱애',
           '병앓이', '병아리','병을 앓다', '병기', '김병', '이병철', '병사', '병렬', '병균', '징병', '모병', '병준',
           '조병갑', '조병식', '김병진', '김병재', '박두병', '권오병', '병원', '병원균', '질병', '재발병', '발병','병역',
           '화병', '수병', '전염병', '성기사', '작성기', '형성기', '보지도못', '보지못한', '보지않은','보지않', '잘보지',
           '가보지', '해보지', '못보지', '보지도않','ㅗ먹어','병진','오ㅗ스','ᇪ','최재명','박건희','이건희','beach','정신병',
           '병자호란','병오년','나병','간질병','병석','병규','홧병','이병헌','병현','병환','병길','지병','병조림','소주병',
           '맥주병','도성기', '삼성기', '성기운', '성기훈', '확성기', '계측기', '발생기', '수신기', '변성기','보지못해', '보지말라고',
           '보지않을까', '보지못함', '보지않아', '보지않게', '보지마세요', '보지도', '보지말자', '보지않는']